### [DataFrame의 인덱스 다루기 - 3]
- 행 인덱스를 정수형 인덱스로 초기화
- 기존 행 인덱스 ==> 컬럼으로 추가 시킴 [기본값]
- 메서드 : 변수명.reset_index()

In [6]:
# [1] 모듈 로딩
import pandas as pd

In [7]:
# [2] 데이터 준비
jumsu ={'name':['마징가','태권V','원더우먼'],
        'kor':[50, 98, 30],
        'eng':[60, 45, 99],
        'math':[97, 78, 89]}

In [8]:
# [3] Dict ==> DataFrame 형태로 저장
jumsuDF=pd.DataFrame(jumsu)
jumsuDF

   name  kor  eng  math
0   마징가   50   60    97
1   태권V   98   45    78
2  원더우먼   30   99    89

In [16]:
DF2=jumsuDF.reset_index()
DF2

   index  name  kor  eng  math
0      0   마징가   50   60    97
1      1   태권V   98   45    78
2      2  원더우먼   30   99    89

In [14]:
DF2.drop('index', axis=1) # DF2.drop(columns='index')와 동일

   name  kor  eng  math
0   마징가   50   60    97
1   태권V   98   45    78
2  원더우먼   30   99    89

In [18]:
# [5] 행 인덱스 초기화 ==> 기존 행을 컬럼으로 추가하지 않기
DF2=jumsuDF.reset_index(drop=True)
DF2

   name  kor  eng  math
0   마징가   50   60    97
1   태권V   98   45    78
2  원더우먼   30   99    89